backend/app/controllers/contracts_controller.rb

INSERT INTO "contracts" ("title", "body") VALUES (?, ?)  [["title", "test"], ["body", "un contrat de test"]]
---
    def new_contract
        if params[:Action] == "newcontrat"
            if params[:id] && params[:title] && params[:body] && params[:id] != "" && params[:title] != "" && params[:body] != ""
                if User.exists?(:id => params[:id])
                    @new_contract = Contract.new
                    @new_contract.authorid = params[:id]
                    @new_contract.title = params[:title]
                    @new_contract.body = params[:body]
                    if @new_contract.save

SELECT "contracts".* FROM "contracts"
---
    def get_contracts
        render json: Contract.all