backend/app/controllers/investments_controller.rb

    def invest
        @new_investment = Investment.create authorid: params[:author_id], destid: params[:dest_id], value: params[:value]
---
INSERT INTO "investments" ("authorid", "destid", "value") VALUES (?, ?, ?)  [["authorid", 42], ["destid", 24], ["value", 420]]

    def get_investments
        render json: Investment.all
---
SELECT "investments".* FROM "investments"