backend/app/controllers/users_controller.rb

    def sign_in
        @user = User.where(pseudo: params[:pseudo], passwd: params[:passwd])
---
SELECT "users".* FROM "users" WHERE "users"."pseudo" = ? AND "users"."passwd" = ?  [["pseudo", "test"], ["passwd", "1234"]]