backend/app/controllers/users_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "xavier.loire@epitech.eu"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "firstname", "name", "pseudo", "capital", "passwd") VALUES (?, ?, ?, ?, ?, ?)  [["email", "xavier.loire@epitech.eu"], ["firstname", "Xavier"], ["name", "Loire"], ["pseudo", "YasuoHitori"], ["capital", 0.0], ["passwd", "xav03101996"]]
---
    def sign_up
        @new_user = User.new
        if params[:Action] == "signup"
            if params[:email] && params[:firstname] && params[:name] && params[:pseudo] && params[:passwd] && params[:email] != "" && params[:firstname] != "" && params[:name] != "" && params[:pseudo] != "" && params[:passwd] != ""
                @new_user.email = params[:email]
                @new_user.firstname = params[:firstname]
                @new_user.name = params[:name]
                @new_user.pseudo = params[:pseudo]
                @new_user.capital = 0
                @new_user.passwd = params[:passwd]
                @new_user.open = false
                if !User.exists?(:pseudo => @new_user.pseudo) && !User.exists?(:email => @new_user.email)
                    if @new_user.save

SELECT COUNT(*) FROM "users" WHERE "users"."email" = ? AND "users"."passwd" = ?  [["email", "xavier.loire@epitech.eu"], ["passwd", "xav03101996"]]
---
    def sign_in
        if params[:Action] == "signin"
            if params[:email] && params[:passwd] && params[:email] != "" && params[:passwd] != ""
                @user = User.where(email: params[:email], passwd: params[:passwd])
                if @user && @user.size == 1

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "xavier.loire@epitech.eu"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "xavier.loire@epitech.eu"], ["LIMIT", 1]]
---
    def forgot_passwd
        if params[:Action] == "lostpasswd"
            if params[:email] && params[:email] != ""
                bool = User.exists?(:email => params[:email])

SELECT "users".* FROM "users"
---
    def get_profiles
        render json: User.all